Public Attributes | List of all members
API_HotspotType Struct Reference
Element Manager API
Represents a hotspot. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | pen
Pen attribute index.
API_Coord  | pos
2D position of the hotspot.
double  | height
Z coordinate of the hotpsot (this can come from a GDL script).
Detailed Description
Represents a hotspot.
Member Data Documentation
◆ head
 API_HotspotType::head
General element header.
◆ height
 API_HotspotType::height
Z coordinate of the hotpsot (this can come from a GDL script).
◆ pen
 API_HotspotType::pen
Pen attribute index.
◆ pos
 API_HotspotType::pos
2D position of the hotspot.